Revit 2027 API
BuiltInFailures.GroupFailures.NotAllGroupsFullyRestored Property
 Not all of the excluded members of the select groups were fully restored. You may be able to restore the remaining members individually or by performing "restore all excluded members" on sub-groups of the selected groups.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAllGroupsFullyRestored { get; }
Public Shared ReadOnly Property NotAllGroupsFullyRestored As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAllGroupsFullyRestored {
	FailureDefinitionId^ get ();
}
static member NotAllGroupsFullyRestored : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace